#include <locale.h>
#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "rus");
    cout << "--------------------------------------------------------------Улитка!----------------------------------------------------------------------------" << endl;

    /* DO_WHILE:
    int i = 0, N = 0, distance = 15, sum = 0;
    cout << "Введите количество дней для передвижения улитки: "; cin >> N;
    do
    {
        cout << "Улитка проползла: " << distance << " см" << endl;
        sum = sum + distance;
        distance += 2;
        i++;
    } while (i<N);
    cout << "Улитка ползала " << N << " дней и проползла " << sum << " см" << endl;
    */

    /* WHILE:
    int i = 0, N = 0, distance = 15, sum = 0;
    cout << "Введите количество дней для передвижения улитки: "; cin >> N;
    while (i<N)
    {
        cout << "Улитка проползла: " << distance << " см" << endl;
        sum = sum + distance;
        distance += 2;
        i++;
    }
    cout << "Улитка ползала " << N << " дней и проползла " << sum << " см" << endl;
    */

    int N = 0, distance = 15, sum = 0;
    cout << "Введите количество дней для передвижения улитки: "; cin >> N;
    for (int i = 0; i < N; i++)
    {
        cout << "Улитка проползла: " << distance << " см" << endl;
        sum = sum + distance;
        distance += 2;
    }
    cout << "Улитка ползала " << N << " дней и проползла " << sum << " см" << endl;

}

/*
Улитка:
   В первый день улитка проползла 15см
   Каждый след.день она проползает на 2 см дальше (17,19,21,23)
   Определить какое общее расстояние проползет улитка через N дней. Число N вводит пользователь.
   Если я введу пять дней, у меня улитка проползет 15+17+19+21+23=95см
   Решить всеми 3-мя способами чтобы логика работы была абсолютно одинакова.
*/